In [1]:
import pandas as pd

>pandas 를 import 하고 ps 라는 단축어로 사용
---

In [2]:
friends_list = [['name',[ 'Jone','Jenny', 'Nate']], 
                ['age', [20, 30, 30]], 
                ['job', ['student', 'developer','teacher']]
]

In [3]:
pd.DataFrame.from_dict(dict(friends_list))

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

>pd.DataFrame.from_items(friends_list) \
>Construct a dataframe from a list of tuples (Deprecated since version 0.23.0)
---

In [4]:
df = pd.DataFrame.from_dict(dict(friends_list))

In [5]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

>index[1~2] 의 정보만 원하는 경우
---

In [6]:
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

>index[0,2] 의 정보만 원하는 경우
---

# by column condition

In [7]:
df[df.age>=25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

## *.query()

In [8]:
df.query('age>=25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

>age 가 25 이상인 값들만 원하는 경우
---

In [9]:
df[(df.age>=25)&(df.name =='Nate')]

   name  age      job
2  Nate   30  teacher

> age 가 25 이상이고, name 이 Nate 인 값들만 원하는 경우
---

In [10]:
friend_list = [
    ['John', 20, 'student'],
    ['Jennt', 30, 'developer'],
    ['Nate', 30, 'teacher']
]

In [11]:
pd.DataFrame.from_records(friend_list)

       0   1          2
0   John  20    student
1  Jennt  30  developer
2   Nate  30    teacher

In [12]:
df = pd.DataFrame.from_records(friend_list)

## *.iloc[index 범위, column 범위]
### by index, column

In [13]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jennt  30
2   Nate  30

>*.iloc[index 범위, column 범위] \
>df.iloc[:,0:2]
---

In [14]:
df.iloc[0:2,1:3]

    1          2
0  20    student
1  30  developer

>*.iloc[index 범위, column 범위] \
>df.iloc[0:2,1:3]
---

# Filter

In [25]:
pd.read_csv('./data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
df = pd.read_csv('./data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

## *.filter(items=["Column Name"])
### by column name

In [27]:
df[['name','age']]

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [35]:
df.filter(items=['name','age'])

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

>*.filter(items=["Column Name","",,,]) \
df.filter(items=['name','age'])
---

In [37]:
df.filter(items=['age','job','name'])

   age        job   name
0   20    student   John
1   30  developer  Jenny
2   30    teacher   Nate
3   40    dentist  Julia
4   45    manager  Brian
5   25     intern  Chris

>*.filter(items=["Column Name","",,,]) \
>df.filter(items=['age','job','name'])
---

## *.filter(like='a', axis=1)
>row 1(=column row) 값들 중에(axis의 의미) 문자 'a'가 있는(like의 의미) column

In [44]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

## *.filter(regex='b\$', axis=1)
>row 1(=column row) 값들 중에(axis의 의미) 정규식(regex) b$(마지막 글자가 b)인 column

In [42]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern